## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                 NAME                  |
|--------|---------------------------------------|
| add    | `aws_iam_policy.write_to_bucket`      |
|        | `aws_iam_role_policy_attachment.oidc` |
| delete | `aws_iam_role_policy.write_to_bucket` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_policy.write_to_bucket will be created
  + resource "aws_iam_policy" "write_to_bucket" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "write_to_salesforce_bucket"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::cds-salesforce-backups/*",
                          + "arn:aws:s3:::cds-salesforce-backups",
                        ]
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role_policy.write_to_bucket will be destroyed
  # (because aws_iam_role_policy.write_to_bucket is not in configuration)
  - resource "aws_iam_role_policy" "write_to_bucket" {
      - id     = "salesforce-backup:write_to_salesforce_bucket" -> null
      - name   = "write_to_salesforce_bucket" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::cds-salesforce-backups/*",
                          - "arn:aws:s3:::cds-salesforce-backups",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "salesforce-backup" -> null
    }

  # aws_iam_role_policy_attachment.oidc will be created
  + resource "aws_iam_role_policy_attachment" "oidc" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "salesforce-backup"
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.cds_salesforce_backups_bucket.aws_s3_bucket.this,
  on .terraform/modules/cds_salesforce_backups_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_versioning resource instead

(and 7 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.write_to_bucket"]

18 tests, 17 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
